# MarkupsNotes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MarkupsNotes Property
ParameterTypeId Class See Also
---
"Notes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MarkupsNotes { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MarkupsNotes As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MarkupsNotes {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace